src/test/resources/createCheckServiceRequest.xml

<?xml version='1.0' encoding='UTF-8'?>
<soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope">
  <soapenv:Body>
    <respos:PostTransactionEx xmlns:respos="http://schemas.micros.com/RESPOS">
      <respos:pGuestCheck>
        <respos:CheckRevenueCenterObjectNum>6</respos:CheckRevenueCenterObjectNum>
        <respos:CheckOrderType>4</respos:CheckOrderType>
        <respos:CheckEmployeeObjectNum>96004</respos:CheckEmployeeObjectNum>
        <respos:CheckID/>
        <respos:pCheckInfoLines>
          <respos:string>******* GRAB ORDER *******</respos:string>
          <respos:string/>
          <respos:string>Name: KEVIN NICKERSON</respos:string>
          <respos:string/>
          <respos:string>Grab Order</respos:string>
          <respos:string>-</respos:string>
          <respos:string>-</respos:string>
        </respos:pCheckInfoLines>
      </respos:pGuestCheck>
      <respos:ppMenuItems>
        <respos:ResPosAPI_MenuItem>
          <respos:MenuItem>
            <respos:MiObjectNum>35014</respos:MiObjectNum>
            <respos:MiMenuLevel>1</respos:MiMenuLevel>
            <respos:MiReference>reference on the menu item</respos:MiReference>
            <respos:ItemDiscount>
              <respos:DiscReference>0</respos:DiscReference>
            </respos:ItemDiscount>
          </respos:MenuItem>
          <respos:Condiments>
            <respos:ResPosAPI_MenuItemDefinition>
              <respos:MiObjectNum>9110161</respos:MiObjectNum>
              <respos:MiMenuLevel>1</respos:MiMenuLevel>
              <respos:MiReference/>
              <respos:ItemDiscount>
                <respos:DiscObjectNum>22</respos:DiscObjectNum>
                <respos:DiscAmountOrPercent>1.00</respos:DiscAmountOrPercent>
              </respos:ItemDiscount>
            </respos:ResPosAPI_MenuItemDefinition>
            <respos:ResPosAPI_MenuItemDefinition>
              <respos:MiObjectNum>9101110</respos:MiObjectNum>
              <respos:MiMenuLevel>1</respos:MiMenuLevel>
              <respos:MiReference/>
              <respos:ItemDiscount>
                <respos:DiscObjectNum>22</respos:DiscObjectNum>
                <respos:DiscAmountOrPercent>1.00</respos:DiscAmountOrPercent>
              </respos:ItemDiscount>
            </respos:ResPosAPI_MenuItemDefinition>
          </respos:Condiments>
        </respos:ResPosAPI_MenuItem>
        <respos:ResPosAPI_MenuItem>
          <respos:MenuItem>
            <respos:MiObjectNum>80037</respos:MiObjectNum>
            <respos:MiMenuLevel>1</respos:MiMenuLevel>
            <respos:MiReference>reference on the menu item</respos:MiReference>
            <respos:ItemDiscount>
              <respos:DiscReference>0</respos:DiscReference>
            </respos:ItemDiscount>
          </respos:MenuItem>
          <respos:Condiments>
            <respos:ResPosAPI_MenuItemDefinition>
              <respos:MiObjectNum>9110161</respos:MiObjectNum>
              <respos:MiMenuLevel>1</respos:MiMenuLevel>
              <respos:MiReference/>
              <respos:ItemDiscount>
                <respos:DiscObjectNum>22</respos:DiscObjectNum>
                <respos:DiscAmountOrPercent>1.00</respos:DiscAmountOrPercent>
              </respos:ItemDiscount>
            </respos:ResPosAPI_MenuItemDefinition>
            <respos:ResPosAPI_MenuItemDefinition>
              <respos:MiObjectNum>9101110</respos:MiObjectNum>
              <respos:MiMenuLevel>1</respos:MiMenuLevel>
              <respos:MiReference/>
              <respos:ItemDiscount>
                <respos:DiscObjectNum>22</respos:DiscObjectNum>
                <respos:DiscAmountOrPercent>1.00</respos:DiscAmountOrPercent>
              </respos:ItemDiscount>
            </respos:ResPosAPI_MenuItemDefinition>
          </respos:Condiments>
        </respos:ResPosAPI_MenuItem>
      </respos:ppMenuItems>
      <respos:pServiceChg>
        <respos:SvcChgObjectNum>1</respos:SvcChgObjectNum>
        <respos:SvcChgAmountOrPercent>2.00</respos:SvcChgAmountOrPercent>
      </respos:pServiceChg>
      <respos:pSubTotalDiscount>
        <respos:DiscObjectNum>3298</respos:DiscObjectNum>
        <respos:DiscAmountOrPercent>5.00</respos:DiscAmountOrPercent>
      </respos:pSubTotalDiscount>
      <respos:pTmedDetail>
        <respos:TmedObjectNum>12</respos:TmedObjectNum>
        <respos:TmedPartialPayment>20.45</respos:TmedPartialPayment>
        <respos:TmedReference>ref001</respos:TmedReference>
        <respos:TmedEPayment/>
      </respos:pTmedDetail>
      <respos:ppCheckPrintLines/>
      <respos:ppVoucherOutput/>
    </respos:PostTransactionEx>
  </soapenv:Body>
</soapenv:Envelope>